{"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "CuDNNLSTM", "config": {"return_state": false, "bias_constraint": null, "stateful": false, "units": 500, "bias_regularizer": null, "go_backwards": false, "recurrent_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0, "dtype": "float32"}}, "kernel_regularizer": null, "batch_input_shape": [null, null, 1], "trainable": true, "unit_forget_bias": true, "return_sequences": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "time_major": false, "name": "cu_dnnlstm", "recurrent_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "seed": null, "rate": 0.2, "name": "dropout", "dtype": "float32"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 1500, "activity_regularizer": null, "name": "dense", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "seed": null, "rate": 0.2, "name": "dropout_1", "dtype": "float32"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "use_bias": true, "units": 5399, "activity_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "trainable": true, "activation": "softmax", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "dtype": "float32", "kernel_constraint": null}}]}, "backend": "tensorflow", "keras_version": "2.2.4-tf"}