{"config": {"name": "sequential", "layers": [{"config": {"go_backwards": false, "recurrent_regularizer": null, "time_major": false, "units": 1, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "return_state": false, "name": "cu_dnnlstm", "recurrent_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "stateful": false, "unit_forget_bias": true, "batch_input_shape": [null, null, 1], "return_sequences": true, "recurrent_initializer": {"config": {"seed": null, "dtype": "float32", "gain": 1.0}, "class_name": "Orthogonal"}, "dtype": "float32", "trainable": true}, "class_name": "CuDNNLSTM"}, {"config": {"rate": 0.2, "noise_shape": null, "seed": null, "name": "dropout", "dtype": "float32", "trainable": true}, "class_name": "Dropout"}, {"config": {"go_backwards": false, "recurrent_regularizer": null, "time_major": false, "units": 1, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "return_state": false, "name": "cu_dnnlstm_1", "recurrent_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "stateful": false, "unit_forget_bias": true, "return_sequences": false, "recurrent_initializer": {"config": {"seed": null, "dtype": "float32", "gain": 1.0}, "class_name": "Orthogonal"}, "dtype": "float32", "trainable": true}, "class_name": "CuDNNLSTM"}, {"config": {"rate": 0.2, "noise_shape": null, "seed": null, "name": "dropout_1", "dtype": "float32", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 2500, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "name": "dense", "use_bias": true, "dtype": "float32", "trainable": true}, "class_name": "Dense"}, {"config": {"rate": 0.2, "noise_shape": null, "seed": null, "name": "dropout_2", "dtype": "float32", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "units": 3941, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "activation": "softmax", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_1", "use_bias": true, "dtype": "float32", "trainable": true}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4-tf"}