{"class_name": "Sequential", "config": {"layers": [{"class_name": "CuDNNLSTM", "config": {"go_backwards": false, "activity_regularizer": null, "dtype": "float32", "recurrent_constraint": null, "batch_input_shape": [null, null, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "stateful": false, "return_state": false, "recurrent_regularizer": null, "name": "cu_dnnlstm", "bias_regularizer": null, "trainable": true, "unit_forget_bias": true, "return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0, "dtype": "float32"}}, "units": 500, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "time_major": false}}, {"class_name": "Dropout", "config": {"rate": 0.2, "noise_shape": null, "seed": null, "name": "dropout", "dtype": "float32", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "dense", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "units": 1500, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "dtype": "float32"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "noise_shape": null, "seed": null, "name": "dropout_1", "dtype": "float32", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "dense_1", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "units": 268, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "activation": "softmax", "dtype": "float32"}}], "name": "sequential"}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}