{"config": {"layers": [{"config": {"recurrent_initializer": {"config": {"gain": 1.0, "dtype": "float32", "seed": null}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "dtype": "float32", "name": "cu_dnnlstm", "activity_regularizer": null, "return_sequences": true, "kernel_constraint": null, "recurrent_regularizer": null, "return_state": false, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "time_major": false, "units": 88, "stateful": false, "batch_input_shape": [null, null, 88], "bias_constraint": null, "trainable": true, "unit_forget_bias": true, "go_backwards": false}, "class_name": "CuDNNLSTM"}, {"config": {"noise_shape": null, "dtype": "float32", "name": "dropout", "rate": 0.2, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "dtype": "float32", "bias_constraint": null, "name": "cu_dnnlstm_1", "activity_regularizer": null, "return_sequences": false, "kernel_constraint": null, "recurrent_regularizer": null, "return_state": false, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "time_major": false, "units": 88, "stateful": false, "unit_forget_bias": true, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "dtype": "float32", "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false}, "class_name": "CuDNNLSTM"}, {"config": {"noise_shape": null, "dtype": "float32", "name": "dropout_1", "rate": 0.2, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "activation": "relu", "activity_regularizer": null, "name": "dense", "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "units": 88, "dtype": "float32", "trainable": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"noise_shape": null, "dtype": "float32", "name": "dropout_2", "rate": 0.2, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "activation": "softmax", "activity_regularizer": null, "name": "dense_1", "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "units": 88, "dtype": "float32", "trainable": true, "bias_constraint": null}, "class_name": "Dense"}], "name": "sequential"}, "keras_version": "2.2.4-tf", "class_name": "Sequential", "backend": "tensorflow"}