{"backend": "tensorflow", "config": {"name": "sequential", "layers": [{"config": {"return_sequences": true, "bias_regularizer": null, "dtype": "float32", "recurrent_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "recurrent_regularizer": null, "kernel_regularizer": null, "time_major": false, "batch_input_shape": [null, null, 88], "bias_constraint": null, "units": 88, "kernel_constraint": null, "go_backwards": false, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0, "dtype": "float32"}, "class_name": "Orthogonal"}, "name": "cu_dnnlstm", "return_state": false, "stateful": false, "unit_forget_bias": true}, "class_name": "CuDNNLSTM"}, {"config": {"trainable": true, "dtype": "float32", "noise_shape": null, "name": "dropout", "rate": 0.2, "seed": null}, "class_name": "Dropout"}, {"config": {"return_sequences": false, "bias_regularizer": null, "dtype": "float32", "recurrent_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "recurrent_regularizer": null, "kernel_regularizer": null, "time_major": false, "bias_constraint": null, "units": 88, "kernel_constraint": null, "go_backwards": false, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0, "dtype": "float32"}, "class_name": "Orthogonal"}, "name": "cu_dnnlstm_1", "return_state": false, "stateful": false, "unit_forget_bias": true}, "class_name": "CuDNNLSTM"}, {"config": {"trainable": true, "dtype": "float32", "noise_shape": null, "name": "dropout_1", "rate": 0.2, "seed": null}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "dtype": "float32", "activation": "relu", "activity_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "units": 88, "kernel_constraint": null, "name": "dense"}, "class_name": "Dense"}, {"config": {"trainable": true, "dtype": "float32", "noise_shape": null, "name": "dropout_2", "rate": 0.2, "seed": null}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "dtype": "float32", "activation": "softmax", "activity_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null, "units": 88, "kernel_constraint": null, "name": "dense_1"}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.2.4-tf"}