{"backend": "tensorflow", "keras_version": "2.2.4-tf", "config": {"name": "sequential", "layers": [{"config": {"name": "cu_dnnlstm", "go_backwards": false, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "units": 88, "trainable": true, "activity_regularizer": null, "return_sequences": true, "kernel_regularizer": null, "time_major": false, "return_state": false, "stateful": false, "unit_forget_bias": true, "batch_input_shape": [null, null, 88], "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0, "dtype": "float32"}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "dtype": "float32", "bias_constraint": null}, "class_name": "CuDNNLSTM"}, {"config": {"name": "dropout", "seed": null, "rate": 0.2, "dtype": "float32", "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "cu_dnnlstm_1", "go_backwards": false, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "time_major": false, "units": 88, "trainable": true, "activity_regularizer": null, "return_sequences": false, "kernel_regularizer": null, "recurrent_constraint": null, "return_state": false, "stateful": false, "unit_forget_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "recurrent_regularizer": null, "bias_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0, "dtype": "float32"}, "class_name": "Orthogonal"}, "dtype": "float32", "bias_constraint": null}, "class_name": "CuDNNLSTM"}, {"config": {"name": "dropout_1", "seed": null, "rate": 0.2, "dtype": "float32", "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "dense", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "use_bias": true, "bias_regularizer": null, "units": 88, "dtype": "float32", "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "activation": "relu", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "seed": null, "rate": 0.2, "dtype": "float32", "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "use_bias": true, "bias_regularizer": null, "units": 88, "dtype": "float32", "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "activation": "softmax", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Dense"}]}, "class_name": "Sequential"}